# FailToDoCompatiblePhaseError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..FailToDoCompatiblePhaseError Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The solution is failing to do the elements Phases are compatible.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailToDoCompatiblePhaseError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailToDoCompatiblePhaseError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailToDoCompatiblePhaseError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace